11/data/attachments/3a128cb77c2298fb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9f3692d2-b0b2-4737-bae9-628b470a21ee</nif:username>
            <nif:friendToBeAdded>John_wide_Friend_24225_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>